{
  "partners": [
    {
      "name": "Roberto Go",
      "role": "Founding Partner",
      "type": "partner",
      "specialty": "Labor and Employment,Family Law and Estate Planning,Land Cases and Legal Conveyances,Corporate and Business Law,Immigration",
      "education": "University of the Philippines College of Law",
      "image": "/images/partners/partners-go.png",
      "largeImage": "/large-images/partners/large-go.jpg",
      "educationDetails": {
        "LawSchool": {
          "name": "University of the East",
          "degree": "Juris Doctor (2024),Bachelor of Laws (1993)"
        },
        "College": {
          "name": "University of Santo Tomas",
          "degree": "AB Liberal Arts major in Behavioral Science (1989)"
        }
      },
      "admitted": "Admitted to the Bar in 1995",
      "about": "Guided by a steadfast commitment to justice and a deep understanding of the law, Roberto E. Go empowers clients with strategic legal solutions tailored to their needs.\n\nRoberto E. Go began his legal journey by earning a Bachelor of Laws degree from the University of the East in 1993. He was admitted to the Philippine Bar in 1995. Prior to his legal studies, he completed a degree in AB Liberal Arts, majoring in Behavioral Science, from the University of Santo Tomas in 1989.\n\nWith a strong foundation in law and a passion for justice, Roberto E. Go built an extensive career handling diverse legal matters. As a Founding Partner of Go Baluyot & Adion Law Office, he has provided expert legal counsel in various fields, including labor and employment law, family law and estate planning, land cases and legal conveyances, corporate and business law, and immigration law.\n\nBeyond private practice, Roberto E. Go has been an active legal consultant for major corporations, including Bounty Fresh Foods, Inc., Nation Paper Products Philippines, and Columbia Technologies, Inc. His legal expertise extends to the real estate sector, where he played a key role as Past President of the Philippine Association of Real Estate Boards. He also serves as a Board of Trustee for Tarlac Living Faith Academy, demonstrating his commitment to both business and community development. Additionally, he currently serves as the Incumbent President of Tarlac Living Faith Christian Baptist Church.\n\nThroughout his career, Roberto E. Go has been known for his strategic legal approach, sharp analytical skills, and unwavering dedication to his clients. Whether advocating in court, negotiating corporate matters, or guiding families through estate planning, he remains steadfast in his mission to provide effective, equitable, and client-centered legal services.",
      "backgroundAndInvolvement": {
        "Go Baluyot & Adion Law Office": "Founding Partner",
        "Philippine Association of Real Estate Boards": "Past President",
        "Bounty Fresh Foods, Inc.": "Consultant / Legal Counsel",
        "Nation Paper Products Philippines": "Consultant / Legal Counsel",
        "Columbia Technologies, Inc.": "Consultant / Legal Counsel",
        "Tarlac Living Faith Academy": "Board of Trustee"
      }
    },
    {
      "name": "Jose Marie Baluyot",
      "role": "Founding Partner",
      "type": "partner",
      "specialty": "Intellectual Property,Family and Business Governance,Government Contracts and Taxation,Corporate and Civil Litigation,Estate and Real Property",
      "education": "Ateneo Law School",
      "image": "/images/partners/partners-baluyot.png",
      "largeImage": "/large-images/partners/large-baluyot.jpg",
      "educationDetails": {
        "LawSchool": {
          "name": "Ateneo de Manila University",
          "degree": "Juris Doctor (2011)"
        },
        "College": {
          "name": "Ateneo de Manila University",
          "degree": "BS Management Major in Legal Management (2007)"
        }
      },
      "admitted": "Admitted to the Bar in 1990",
      "about": "Jose Marie M. Baluyot is a dynamic partner at Go Baluyot & Adion, where he utilizes his innovative, out-of-the-box thinking to tackle complex legal challenges, drawing from his extensive experience in a variety of practice areas, including business law, corporate governance, intellectual property, real estate transactions, and complex litigation. Known for his ability to develop creative legal strategies that achieve successful outcomes, even in cases where traditional methods have fallen short, Pj—his common nickname—has built a reputation for pushing the limits of conventional legal thinking, establishing himself as a leader in his area of practice.\n\nPrior to founding Go Baluyot & Adion Law Office in 2016, Pj developed his legal expertise through internships and positions at prominent firms. He started with an internship at Zambrano & Gruba Law Office in 2009 and later worked as an associate attorney at Ortega Bacorro Odulio Calma & Carbonell in 2012. During his time at Ortega Bacorro Odulio Calma & Carbonell, Pj quickly gained recognition for his ability to effectively manage intellectual property disputes and complex commercial and business law cases. He was entrusted with handling the intellectual property matters of several multinational and globally recognized clients, including Shell, Chevron, Bayer, Ferrari, Penguin, Dolce & Gabbana, Rimowa, Smeg, Supreme, and Harvard University, among others. Owing to his profound expertise in intellectual property, the Intellectual Property Office of the Philippines nominated him to attend the 2024 Japan Patent Office/IP Rights Training Course for Practitioners Specializing in Trademark in Tokyo, Japan.\n\nPj’s success in overseeing high-stakes disputes and advising corporate clients laid a solid foundation for his career. After relocating his practice to Tarlac in 2016, he took on a role as a legal secondee at GlaxoSmithKline Philippines, Inc., further refining his expertise in corporate housekeeping and contract management. From 2016 to 2020, he also taught law courses at Tarlac State University, aiming to share his legal knowledge and inspire the next generation to approach legal studies with passion and dedication. Currently, Pj holds several key positions in corporations, local government units, and private institutions, where his innovative legal insights are highly valued by stakeholders.\n\nBeyond his legal practice, Pj is likewise deeply engaged in the community. He serves as an active member of the Integrated Bar of the Philippines – Tarlac Chapter, is the incoming President of the Rotary Club of Central Tarlac, and acts as legal counsel for the Don Bosco Tarlac Past Pupils Association.",
      "backgroundAndInvolvement": {
        "Go Baluyot & Adion Law Office": "Founding Partner",
        "Municipality of La Paz, Tarlac": "Management Consultant",
        "Big E Food Corporation": "Legal Head",
        "Don Bosco Past Pupils Association": "Legal Counsel",
        "Rotary Club of Central Tarlac": "President Elect"
      }
    },
    {
      "name": "Noel Adion",
      "role": "Founding Partner",
      "type": "partner",
      "specialty": "Criminal Prosecution and Defense,Agrarian Law and Land Cases,Civil Litigation,Administrative Law,Family Law",
      "education": "San Beda College of Law",
      "image": "/images/partners/partners-adion.png",
      "largeImage": "/large-images/partners/large-adion.jpg",
      "educationDetails": {
        "LawSchool": {
          "name": "University of the East",
          "degree": "Juris Doctor (2024),Bachelor of Laws (1997)"
        },
        "College": {
          "name": "Ateneo de Manila University",
          "degree": "AB Liberal Arts Major in Behavioral Science (1992)"
        }
      },
      "admitted": "Admitted to the Bar in 1990",
      "about": "Noel S. Adion is a forward-thinking partner at Go Baluyot & Adion, where his creative, unconventional approach helps him address complex legal issues with remarkable success. Drawing upon his extensive expertise across various legal domains—such as criminal prosecution and defense, agrarian law and land disputes, civil litigation, administrative law, and family law—Adion has established a reputation for developing innovative legal strategies that consistently deliver favorable results, even when traditional methods have proven ineffective.\n\nBefore establishing Go Baluyot & Adion Law Office, Adion honed his legal skills through various high-profile roles and academic endeavors. He previously served as the Chief of the Legal Division at the Department of Agrarian Reform and as an Associate Provincial Prosecutor at the Office of the Provincial Prosecutor. In these roles, Adion demonstrated exceptional competence in handling complex legal cases, particularly those involving agrarian law, criminal prosecution, and civil litigation.\n\nBeyond his legal practice, Adion has made notable contributions to legal education, teaching law courses at Tarlac State University’s School of Law and College of Business & Accountancy. His dedication to mentoring future legal professionals reflects his commitment to fostering a passion for legal studies and excellence.\n\nAdion earned his Juris Doctor degree in 2024 and his Bachelor of Laws degree in 1997 from the University of the East. He also holds a degree in AB Liberal Arts Major in Behavioral Science from the University of Santo Tomas, completed in 1992.\n\nPresently, Adion holds prominent roles within corporations, local government units, and private organizations, where his forward-thinking legal insights are highly valued by stakeholders.",
      "backgroundAndInvolvement": {
        "Go Baluyot & Adion Law Office": "Founding Partner",
        "TSU School of Law": "Professor",
        "TSU College of Business & Accountancy": "Professor",
        "Department of Agrarian Reform": "Former Chief of Legal Division",
        "Office of the Provincial Prosecutor": "Former Associate Provincial Prosecutor"
      }
    }
  ],
  "associates": [
    {
      "name": "Ruth Hazel Galang",
      "role": "Senior Associate Lawyer",
      "type": "associate",
      "specialty": "Real Estate,Immigration Law,Administrative Law,Criminal Prosecution and Defense",
      "education": "Tarlac State University",
      "image": "/images/atty/atty-ruth.png",
      "largeImage": "/large-images/atty/large-galang.jpg",
      "educationDetails": {
        "LawSchool": {
          "name": "Tarlac State University",
          "degree": "Juris Doctor (2019)"
        },
        "College": {
          "name": "Tarlac State University",
          "degree": "AB Communication (2015)"
        }
      },
      "admitted": "Admitted to the Bar in 2020",
      "about": "Atty. Ruth Hazel A. Galang is an associate lawyer at Go Baluyot & Adion, recognized for her innovative approach to addressing complex legal issues with exceptional efficiency. Specializing in real estate, immigration law, administrative law, and criminal prosecution and defense, Atty. Galang has earned a reputation for developing creative legal strategies that achieve successful outcomes, even when traditional methods fall short.\n\nSince joining Go Baluyot & Adion Law Office, Atty. Galang has diligently refined her legal expertise through various roles and academic experiences. Her ability to effectively manage intricate legal cases, particularly in real estate, immigration, and criminal law, has garnered her respect and acknowledgment within the legal community.\n\nShe obtained her Juris Doctor degree in 2019 and her AB Communication degree in 2015, both from Tarlac State University.",
      "backgroundAndInvolvement": {}
    },
    {
      "name": "Shan Jerome Samoy",
      "role": "Associate Lawyer",
      "type": "associate",
      "specialty": "Corporate Law,Family and Property Law,Labor Relations and Disputes",
      "education": "Tarlac State University",
      "image": "/images/atty/atty-samoy.png",
      "largeImage": "/large-images/atty/large-samoy.jpg",
      "educationDetails": {
        "LawSchool": {
          "name": "Tarlac State University",
          "degree": "Juris Doctor (2021)"
        },
        "College": {
          "name": "Tarlac State University",
          "degree": "BS Criminology (2016)"
        }
      },
      "admitted": "Admitted to the Bar in 2022",
      "about": "Atty. Shan Jerome L. Samoy is a highly skilled and dedicated legal professional who has been practicing law since 2022. With a solid foundation in both litigation and corporate law, Atty. Shan has developed a diverse and well-rounded legal practice that enables him to offer comprehensive legal services to his clients.\n\nWith nearly three years of experience in litigation, Atty. Shan has successfully represented clients in a variety of legal disputes, demonstrating exceptional advocacy skills and a keen understanding of courtroom procedures. His ability to navigate complex legal challenges with clarity and precision has earned him a reputation for being a determined and effective litigator.\n\nIn addition to his litigation expertise, Atty. Shan has accumulated almost two years of experience in corporate law, advising businesses on a range of legal matters including contract negotiations, mergers and acquisitions, regulatory compliance, and corporate governance. His ability to bridge the gap between legal theory and business strategy has made him a trusted advisor to corporate clients seeking legal counsel on matters crucial to their operations and growth.\n\nKnown for his professionalism, attention to detail, and strong work ethic, Atty. Shan is committed to providing high-quality legal services with integrity and dedication. He continues to expand his legal knowledge and expertise, establishing himself as a reliable and effective legal practitioner in both litigation and corporate law.\n\nKnown for his professionalism, attention to detail, and strong work ethic, Atty. Shan is committed to providing high-quality legal services with integrity and dedication. He continues to expand his legal knowledge and expertise, establishing himself as a reliable and effective legal practitioner in both litigation and corporate law.",
      "backgroundAndInvolvement": {
        "Go Baluyot & Adion Law Office": "Senior Associate Lawyer",
        "Tarlac State University": "Professor"
      }
    },
    {
      "name": "Rosel Joy Provido",
      "role": "Associate Lawyer",
      "type": "associate",
      "specialty": "Civil and Family Law,Criminal Law,Property and Real Estate Transactions,Estate and Succession",
      "education": "Tarlac State University",
      "image": "/images/atty/atty-jui.png",
      "largeImage": "/large-images/atty/large-provido.jpg",
      "educationDetails": {
        "LawSchool": {
          "name": "Tarlac State University",
          "degree": "Juris Doctor (Valedictorian) (2020)"
        },
        "College": {
          "name": "Ateneo de Davao University",
          "degree": "AB Political Science, Minor in Economics (2013)"
        }
      },
      "admitted": "Admitted to the Bar in 2022",
      "about": "Atty. Rosel Joy A. Provido is a driven and committed lawyer with almost three years of experience focusing on litigation. Her expertise isn't limited to just one area; she has a strong grasp of criminal law, civil law, administrative law and the intricacies of special proceedings. Beyond the courtroom, she also assists clients with real estate transactions and estate planning, offering comprehensive legal guidance across various needs.\n\nAtty. Provido's journey began in Davao City, where she earned a degree of Bachelor of Arts in Political Science, Minor in Economics from Ateneo de Davao University in 2013. Her exposure to international perspectives came in 2012 through a brief training at the International Islamic University of Malaysia, where she gained insights into politics in the Muslim world. In 2020, she graduated top of her class with a Juris Doctor degree from Tarlac State University, earning a scholarship from the Justice Jose C. dela Rama Sr. Law Foundation.\n\nEven during law school (starting in 2017), Atty. Provido demonstrated her strong work ethic by simultaneously serving as a legal researcher for the Provincial Legal Office and a college lecturer at the Philippine Women's University - Tarlac City, teaching subjects ranging from corporate law, taxation, constitutional law, history, philosophy, economics, sociology, and humanities. In 2019, she further honed her legal skills as a legal researcher in the Office of the Provincial Governor, working closely with the governor on drafting executive orders and other official communications. After graduating from law school, she gained practical experience as a paralegal at Go Baluyot & Adion Law Office.\n\nWhile awaiting the results of the 2021/2022 bar exam (also known as the “Best Bar Ever”), she served as a Court Decongestion Officer at the Regional Trial Court Branch 110 of Tarlac City. After successfully passing the bar in the same year, she began working as an associate lawyer at Go Baluyot & Adion Law Office and as a legal consultant at the Office of the Provincial Governor. Currently, in addition to her work as a litigation lawyer, she also shares her knowledge as an instructor in the Criminology Department at Osias Colleges Inc. She broadened her legal experience with a short stint as a paralegal at The Murphy Law Firm, LLC, which practices family law in Washington D.C. and Maryland, USA – an opportunity she pursued during a sabbatical from her work as an associate lawyer at Go Baluyot & Adion Law Office, taken to welcome the birth of her child.\n\nAtty. Provido's meticulously crafted legal foundation is her distinct advantage. By seamlessly integrating her academic prowess with her diverse real-world experiences, she delivers comprehensive and strategic legal solutions, consistently striving for optimal outcomes for her clients.",
      "backgroundAndInvolvement": {
        "Osias Colleges Inc. (Criminology Department)": "College Lecturer",
        "Leal Group of Companies": "Legal Consultant",
        "Nationalist People's Coalition": "Election Lawyer",
        "Hon. Eugenio \"Jun\" Ynion Jr.": "Former Election Lawyer",
        "Partido ng Demokratiko Pilipino Lakas ng Bayan": "Former Election Lawyer",
        "The Murphy Law LLC": "Former Paralegal",
        "Office of the Provincial Governor of Tarlac Province": "Former Legal Consultant and Legal Researcher",
        "Provincial Legal Office": "Former Legal Researcher",
        "Philippine Women's University - Tarlac City": "Former College Lecturer"
      }
    },
    {
      "name": "Rialeen Grace Balmores",
      "role": "Associate Lawyer",
      "type": "associate",
      "specialty": "Civil Litigation,Special Proceedings,Commercial Law",
      "education": "University of the Cordilleras",
      "image": "/images/atty/atty-rialeen.png",
      "largeImage": "/large-images/atty/large-balmores.jpg",
      "educationDetails": {
        "LawSchool": {
          "name": "University of the Cordilleras",
          "degree": "Juris Doctor (2022)"
        },
        "College": {
          "name": "University of the Philippines Baguio",
          "degree": "BA Social Sciences (Cum Laude) (2016)"
        }
      },
      "admitted": "Admitted to the Bar in 2023",
      "about": "Atty. Rialeen Grace V. Balmores is a dedicated and results-driven lawyer currently practicing as a Junior Associate at Go Baluyot & Adion Law Office. Before becoming a lawyer, she worked as a paralegal in the same firm, gaining valuable hands-on experience in legal research, case preparation, and client assistance. She earned her Juris Doctor degree from the University of the Cordilleras in 2022 and was admitted to the Bar in 2023. Since then, she has been actively engaged in legal practice, specializing in civil cases and special proceedings.\n\nPassionate about upholding justice and providing legal assistance to those in need, Atty. Balmores has developed significant experience in handling a wide range of cases, including property disputes, labor matters, criminal cases, guardianship, annulment, and other related legal concerns. With a solid grasp of both procedural and substantive law, she effectively represents clients in judicial and quasi-judicial proceedings. Her strong analytical skills, meticulous legal research, and persuasive drafting allow her to craft strong legal arguments and develop sound litigation strategies. She is also skilled in offering strategic legal guidance and simplifying complex legal matters.\n\nAs a legal professional, Atty. Balmores is dedicated to client-centered advocacy, ensuring that every case she handles is approached with diligence, integrity, and a clear focus on protecting her clients' rights and interests. Committed to her mission of promoting justice, Atty. Balmores continuously hones her expertise to better serve individuals and communities in need of legal guidance.",
      "backgroundAndInvolvement": {}
    },
    {
      "name": "Christzabelle Villa",
      "role": "Associate Lawyer",
      "type": "associate",
      "specialty": "Criminal Prosecution and Defense,Civil and Property Disputes,Corporate Matters",
      "education": "Tarlac State University",
      "image": "/images/atty/atty-christzabelle.png",
      "largeImage": "/large-images/atty/large-villa.jpg",
      "educationDetails": {
        "LawSchool": {
          "name": "Tarlac State University",
          "degree": "Juris Doctor (2021)"
        },
        "College": {
          "name": "College of the Holy Spirit",
          "degree": "BS Psychology (Cum Laude) (2014)"
        }
      },
      "admitted": "Admitted to the Bar in 2022",
      "about": "Atty. Villa is a dedicated and skilled lawyer with a diverse range of experience, including successful handling of criminal, civil, land dispute, and registration cases and special proceedings. Known for her ability to effectively represent clients in various aspects of legal practice, she consistently achieves favorable outcomes through her experience in negotiation techniques.\n\nShe has years of experience in conducting legal research and drafting precise orders and resolutions for judicial review at the Regional Trial Court where she demonstrated a high level of attention to detail- a critical skill for legal expertise. She has rendered public service under the Legal Department of the Municipal government and continuously acts as a consultant for local governance, providing valuable insights into public policy and regulatory matters.\n\nOffering notarial services, she ensures that legal documents are executed in compliance with all relevant laws and regulations, maintaining the integrity of legal transactions.\n\nShe consistently upholds excellence in everything she does, and holds a degree in Psychology where she graduated Cum Laude. Her experience in HR as a licensed psychometrician for a multinational corporation is a unique background that enhances her abilities as a lawyer, allowing for a deep understanding of human behavior and a strategic approach to legal advocacy.\n\nShe currently holds the esteemed position of Director of the Integrated Bar of the Philippines Tarlac Chapter, another testament to her leadership, efficiency and commitment to elevating the standards of the legal profession.",
      "backgroundAndInvolvement": {}
    },
    {
      "name": "Suzanne Cruz",
      "role": "Associate Lawyer",
      "type": "associate",
      "specialty": "Criminal Prosecution and Defense,Special Proceedings,Civil Litigation",
      "education": "Tarlac State University",
      "image": "/images/atty/atty-suzanne.png",
      "largeImage": "/large-images/atty/large-cruz.jpg",
      "educationDetails": {
        "LawSchool": {
          "name": "Tarlac State University",
          "degree": "Juris Doctor (2022)"
        },
        "College": {
          "name": "Tarlac State University",
          "degree": "Bachelor of Arts in Political Science (2014)"
        }
      },
      "admitted": "Admitted to the Bar in 2022",
      "about": "Driven by her goal to provide top notch legal services to clients across walks of life, ATTY. SUZANNE PAGADUAN CRUZ provides legal services with hard work and excellence.\n\nAtty. Cruz began her career as a University Lecturer, Technical Writer, Chairperson of Gender Studies, and Research Unit Head for Tarlac State University from 2011 to 2018.\n\nHer desire to improve policies for Gender and Development, sparked her interest to advance her knowledge in the field of law. The study of law became a devotion for her, so she decided to delve in professional legal career in 2018 as a legal researcher for the Provincial Government of Tarlac Legal Office.\n\nAfter taking the Bar Examination in 2022, Atty. Cruz’ name was included in the Supreme Court of the Philippines roll of attorneys. She became a Legal Consultant for the Provincial Government of Tarlac from 2023 to 2024, and an associate attorney for Escalona and Fonacier Law Offices handling various types of cases from criminal, civil, special proceedings, land case, labor case, and administrative cases.\n\nMost of her caseloads involves criminal cases and civil cases on marriage and property. Her professional experience in Escalona and Fonacier Law Office equipped her with competence in handling land cases, voluntary dealings, and real estate conveyance.\n\nIn 2023, Atty. Cruz also worked for foreign clients particularly, Louis Law Group LLC and Virescent Land LLC, both located in Florida, USA. She also served as Real Estate Consultant for AlphainBay, a real estate company in California, USA.\n\nAt present, Atty. Cruz is an associate attorney for Go Baluyot and Adion Law Office. Her case load involves cases relating to crimes against persons and properties, and civil cases involving property disputes. She strives to be known as an effective and efficient attorney, with strong sense of equity and justice and commitment towards her clients.",
      "backgroundAndInvolvement": {
        "Louis Law Group (Miami, Florida, USA)": "Legal Assistant",
        "Escalona and Fonacier Law Offices": "Associate Attorney",
        "Provincial Government of Tarlac": "Law Consultant",
        "Tarlac State University": "Researcher, Writer, & University Lecturer"
      }
    },
    {
      "name": "John October Go",
      "role": "Associate Lawyer",
      "type": "associate",
      "specialty": "Criminal Prosecution and Defense,Civil Litigation,Estate and Real Property",
      "education": "Tarlac State University",
      "image": "/placeholder/placeholder.png",
      "largeImage": "/placeholder/placeholder.png",
      "educationDetails": {
        "LawSchool": {
          "name": "Tarlac State University",
          "degree": "Juris Doctor (2024)"
        },
        "College": {
          "name": "Saint Louis University",
          "degree": "Bachelor of Arts in Political Science (2007)"
        }
      },
      "admitted": "Admitted to the Bar in 2025",
      "about": "Atty. John October M. Go is a dedicated and results-driven legal professional with a strong background in law and political science. He earned his Bachelor of Arts in Political Science from Saint Louis University in 2007, where he developed a deep understanding of governance, legal systems, and public policy. His passion for justice and legal advocacy led him to pursue a Juris Doctor degree at TSU School of Law, which he successfully completed in 2024. He was admitted to the Philippine Bar in 2025, marking the beginning of his formal legal practice. With expertise in Criminal Prosecution and Defense, Civil Litigation, and Estate & Real Property, Atty. Go has developed a reputation for his analytical approach, strategic case handling, and commitment to protecting the rights and interests of his clients. Whether defending the accused, representing clients in civil disputes, or navigating the complexities of real estate and estate law, he brings a high level of dedication and professionalism to every case. Beyond his legal practice, Atty. Go is passionate about continuous learning and staying updated with the latest legal developments to provide well-informed and effective counsel. Known for his integrity, meticulous attention to detail, and strong advocacy skills, he strives to deliver justice and equitable solutions for individuals, businesses, and organizations.",
      "backgroundAndInvolvement": {}
    },
    {
      "name": "Dyords Louise Tiglao",
      "role": "Associate Lawyer",
      "type": "associate",
      "specialty": "",
      "education": "Far Eastern University - Makati",
      "image": "/images/atty/atty-dyords.png",
      "largeImage": "/large-images/atty/large-tiglao.jpg",
      "educationDetails": {
        "LawSchool": {
          "name": "Far Eastern University - Makati",
          "degree": "Juris Doctor (2023)"
        },
        "College": {
          "name": "Far Eastern University - Manila",
          "degree": "Bachelor of Arts in Political Science (2017)"
        }
      },
      "admitted": "Admitted to the Bar in 2025",
      "about": "Atty. Dyords Louise D. Tiglao is a dedicated and diligent lawyer known for her strategic thinking, attention to detail, and strong sense of advocacy. With a calm yet assertive presence, she is committed to upholding the principles of justice and delivering client-focused legal solutions.\n\nShe earned her Bachelor of Arts in Political Science in 2017 from Far Eastern University – Manila, and subsequently completed her Juris Doctor degree in 2023 at Far Eastern University – Makati. During her academic years, Atty. Tiglao gained valuable exposure to the inner workings of public legal institutions through internships at the Bureau of Customs in 2017 and the Regional Trial Court of Makati in 2019. From 2018 to 2022, she was also an active member of the FEU Legal Aid Bureau, where she served as a student practitioner and provided pro bono legal consultations through various organized outreach programs. This early immersion in public service sharpened her advocacy skills and strengthened her commitment to accessible legal assistance.\n\nHer professional journey with the firm began in 2021 when she served as a paralegal, gaining hands-on experience in legal research, case preparation, and client engagement. Following her admission to the Philippine Bar in 2025, she rejoined the firm as an associate lawyer, bringing with her a broadened perspective and an expanded legal knowledge.\n\nIn addition to her practice in the Philippines, Atty. Tiglao also works with a personal injury law firm based in Washington, United States, where she handles cases involving car crashes and insurance claims, among others. This international experience has enriched her understanding of cross-border legal systems and diversified her legal practice.\n\nNow beginning her private practice, Atty. Tiglao draws from her solid foundation of academic achievement, public service, and international exposure. With a clear commitment to growth and a passion for the legal profession, she looks forward to honing her craft and making a meaningful contribution to the field of law.",
      "backgroundAndInvolvement": {
        "Go Baluyot & Adion Law Office": "Senior Associate Lawyer",
        "Tarlac State University": "Professor"
      }
    }
  ],
  "staff": [
    {
      "name": "Ria Zarina Nasarro",
      "role": "Paralegal",
      "type": "staff",
      "image": "/placeholder/placeholder.png"
    },
    {
      "name": "Mariz Magallanes",
      "role": "Accounting Staff",
      "type": "staff",
      "image": "/images/staff/mariz.png"
    },
    {
      "name": "Gerica Pimentel",
      "role": "Admin",
      "type": "staff",
      "image": "/images/staff/gia.png"
    },
    {
      "name": "Diana Palomino",
      "role": "Legal Secretary",
      "type": "staff",
      "image": "/images/staff/diana.png"
    },
    {
      "name": "Jocelyn Salvador",
      "role": "Legal Secretary",
      "type": "staff",
      "image": "/images/staff/jocelyn.png"
    },
    {
      "name": "Gil-San Balagtas",
      "role": "Legal Secretary",
      "type": "staff",
      "image": "/images/staff/gil-san.png"
    },
    {
      "name": "Alexander Milla",
      "role": "Legal Staff",
      "type": "staff",
      "image": "/images/staff/alex.png"
    },
    {
      "name": "Victor Gil Tolentino",
      "role": "Liaison Officer",
      "type": "staff",
      "image": "/placeholder/placeholder.png"
    }
  ]
}
